{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Week 5: Graph Data Modelling (Neo4j)\n",
    "### Student ID: [#####]\n",
    "### Subtasks Done: [#,#,..]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 1: Convert a RDB to a Graph DB\n",
    "In this task, you are going to:\n",
    "- Watch a Video explaining the advtanges of Graph Databases over RDBMS\n",
    "- Remodel a toy RDB into a Graph DB.\n",
    "- Create the a graph of the toy database using Cyper Language"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Watch the following video and mention some of the advantages of using Graph Databases over RDBMS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"560\"\n",
       "            height=\"315\"\n",
       "            src=\"https://www.youtube.com/embed/NO3C-CWykkY\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f3b442a4050>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from IPython.display import IFrame\n",
    "IFrame('https://www.youtube.com/embed/NO3C-CWykkY', width=560, height=315)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<font color = \"Red\"><b>Advantages of Using Neo4J over RDBMS:</b></font>\n",
    "<br>1. \n",
    "<br>2.\n",
    "<br>3."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Given the following toy relational database, Convert this toy database into a Graph database using any drawing software. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"RDBSchema.png\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#### YOUR IMAGE of The Property Graph Schema HERE (use whatever drawing tool)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Use Cypher Query Language to create the above Graph toy database, you have just drawed"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### py2neo\n",
    "\n",
    "py2neo is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install py2neo with pip install py2neo.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "  Downloading py2neo-2021.2.4-py2.py3-none-any.whl.metadata (9.9 kB)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.11/site-packages (from py2neo) (2023.7.22)\n",
      "Collecting interchange~=2021.0.4 (from py2neo)\n",
      "  Downloading interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n",
      "Collecting monotonic (from py2neo)\n",
      "  Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)\n",
      "Requirement already satisfied: packaging in /opt/conda/lib/python3.11/site-packages (from py2neo) (23.2)\n",
      "Collecting pansi>=2020.7.3 (from py2neo)\n",
      "  Downloading pansi-2020.7.3-py2.py3-none-any.whl (10 kB)\n",
      "Requirement already satisfied: pygments>=2.0.0 in /opt/conda/lib/python3.11/site-packages (from py2neo) (2.16.1)\n",
      "Requirement already satisfied: six>=1.15.0 in /opt/conda/lib/python3.11/site-packages (from py2neo) (1.16.0)\n",
      "Requirement already satisfied: urllib3 in /opt/conda/lib/python3.11/site-packages (from py2neo) (2.0.6)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from interchange~=2021.0.4->py2neo) (2023.3.post1)\n",
      "Downloading py2neo-2021.2.4-py2.py3-none-any.whl (177 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m177.2/177.2 kB\u001b[0m \u001b[31m2.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m0:01\u001b[0m\n",
      "\u001b[?25hInstalling collected packages: monotonic, pansi, interchange, py2neo\n",
      "Successfully installed interchange-2021.0.4 monotonic-1.6 pansi-2020.7.3 py2neo-2021.2.4\n"
     ]
    }
   ],
   "source": [
    "! pip install py2neo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Connect\n",
    "\n",
    "Connect to Neo4j with the Graph class.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "try:\n",
    "    graph = Graph(\"bolt://neo:7687\")\n",
    "except:\n",
    "    print(\"Error Connection to Neo4j DB!!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### clear every thing in the graph DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Nodes\n",
    "\n",
    "Create nodes with the Node class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "#Person_Nodes\n",
    "charlSheen = Node(\"Person\", id=1, name=\"Charlie Sheen\")\n",
    "MichDouglas = Node(\"Person\", id=2, name=\"Micheal Douglas\")\n",
    "martSheen = Node(\"Person\", id=3, name=\"Martin Sheen\")\n",
    "morgan = Node(\"Person\", id=4, name=\"Morgan Freeman\")\n",
    "\n",
    "#Movie_Nodes\n",
    "\n",
    "wallst = Node(\"Movie\", id=1, title=\"Wall Street\", year=1987)\n",
    "americanPres = Node(\"Movie\",id=2, title=\"The American President\", year=1995)\n",
    "shawshank = Node(\"Movie\",id=3, title=\"The Shawshank Redemption\", year=1994)\n",
    "\n",
    "#Country_Nodes\n",
    "usa = Node(\"Country\", name=\"USA\")\n",
    "\n",
    "\n",
    "graph.create(charlSheen | MichDouglas | martSheen | morgan | wallst | americanPres | shawshank | usa)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Check created nodes in the graph using Cypher query (Find all nodes in your DB)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Country', name='USA')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN n\n",
    "\"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Relationships\n",
    "\n",
    "Create relationships between nodes with the Relationship class.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "#MADE_IN RelationShips\n",
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(wallst, \"MADE_IN\", usa))\n",
    "graph.create(Relationship(americanPres, \"MADE_IN\", usa))\n",
    "graph.create(Relationship(shawshank, \"MADE_IN\", usa))\n",
    "\n",
    "#PLAYED Relationships\n",
    "graph.create(Relationship(charlSheen, \"PLAYED\", wallst, role=[\"Bud Fox\"]))\n",
    "graph.create(Relationship(martSheen, \"PLAYED\", wallst, role=[\"Carl Fox\"]))\n",
    "graph.create(Relationship(MichDouglas, \"PLAYED\", wallst, role=[\"Gordon Gekko\"]))\n",
    "\n",
    "graph.create(Relationship(martSheen, \"PLAYED\", americanPres, role=[\"A.J. MacInerney\"]))\n",
    "graph.create(Relationship(MichDouglas, \"PLAYED\", americanPres, role=[\"President Andrew Shepherd\"]))\n",
    "\n",
    "graph.create(Relationship(morgan, \"PLAYED\", shawshank, role=[\"Ellis Boyd 'Red' Redding\"]))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extend you \"Movies\" Knowledge Graph (The power of Graph DBs!!)\n",
    "\n",
    "Imagine now that we are going to extend our graph DB with new movies, actors, even with new directors.\n",
    "\n",
    "- We add <b>\"The matrix\"</b> movie which was released in <b>(1999)</b>, and has a new property \"Tagline\" <b>(\"Welcome to the Real World\")</b>.\n",
    "- We also add 4 new actors (Person):\n",
    "    - \"Keanu Reeves\" who was born in (1964). Note \"born\" property is also new.\n",
    "    - \"Carrie-Anne Moss\" who was born in (1967).\n",
    "    - \"Laurence Fishburne\" who was born in (1960).\n",
    "    - \"Hugo Weaving\" who was born in (1960).\n",
    "- Moreover, we add 3 directors (Person) :\n",
    "    - 'Lilly Wachowski', born in (1967)\n",
    "    - 'Lana Wachowski', born in(1965)\n",
    "    - 'Joel Silver', born in (1952)\n",
    "- For these directors specify one more Label (\"Director\").\n",
    "- We Create a new <b>RelationType \"DIRECTED\" </b> that goes from the later 3 director nodes to \"the Matrix\" movie node."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the \"The Matrix\" new movie node into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=4, title='The Matrix', year=1999)\n"
     ]
    }
   ],
   "source": [
    "creMoviequery =\"\"\"\n",
    "    CREATE (movie:Movie {id: 4, title: 'The Matrix', year: 1999})\n",
    "    RETURN movie\n",
    "\"\"\"\n",
    "data = graph.run(creMoviequery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the Actors nodes into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "creActorsquery =\"\"\"\n",
    "    FOREACH (data in [\n",
    "        {id: 5, name: 'Keanu Reeves', born: 1964},\n",
    "        {id: 6, name: 'Carrie-Anne Moss', born: 1967},\n",
    "        {id: 7, name: 'Laurence Fishburne', born: 1960},\n",
    "        {id: 8, name: 'Hugo Weaving', born: 1960}\n",
    "    ] |\n",
    "    CREATE (p:Person)\n",
    "    SET p = data\n",
    ")\n",
    "\"\"\"\n",
    "data = graph.run(creActorsquery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the Director nodes into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "creDirectorsquery =\"\"\"\n",
    "    FOREACH (data in [\n",
    "        {id: 9, name: 'Lilly Wachowski', born: 1967, label: 'Director'},\n",
    "        {id: 10, name: 'Lana Wachowski', born: 1965, label: 'Director'},\n",
    "        {id: 11, name: 'Joel Silver', born: 1952, label: 'Director'}\n",
    "    ] |\n",
    "    CREATE (p:Person)\n",
    "    SET p = data\n",
    ")\n",
    "\"\"\"\n",
    "data = graph.run(creDirectorsquery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Country', name='USA')\n",
      "Node('Movie', id=4, title='The Matrix', year=1999)\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1965, id=10, label='Director', name='Lana Wachowski')\n",
      "Node('Person', born=1967, id=9, label='Director', name='Lilly Wachowski')\n",
      "Node('Person', born=1965, id=10, label='Director', name='Lana Wachowski')\n",
      "Node('Person', born=1952, id=11, label='Director', name='Joel Silver')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1967, id=9, label='Director', name='Lilly Wachowski')\n",
      "Node('Person', born=1952, id=11, label='Director', name='Joel Silver')\n"
     ]
    }
   ],
   "source": [
    "# Verify\n",
    "query = \"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN n\n",
    "\"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the required relationships into your DB\n",
    "- (actor) -- :PLAYED(role(s)) --> (The Matrix Movie)\n",
    "- (director)-- :DIRECTED--> (The Matrix Movie)    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 5}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:PLAYED {role: ['Neo']}]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 6}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:PLAYED {role: ['Trinity']}]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 7}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:PLAYED {role: ['Morpheus']}]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 8}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:PLAYED {role: ['Agent Smith']}]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# directed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 9}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:DIRECTED]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "creRELSquery =\"\"\"\n",
    "    MATCH (person:Person {id: 10}), (movie:Movie {id: 4})\n",
    "    CREATE (person)-[:DIRECTED]->(movie)\n",
    "\"\"\"\n",
    "data = graph.run(creRELSquery)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Delete some f*** up things"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (p:Person {id: 8})-[r:PLAYED]->(m:Movie {id: 4})\n",
    "    DELETE r\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (p:Person {id: 11})\n",
    "    DELETE p\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (m:Movie {id: 4})\n",
    "    DELETE m\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Another way, we can run this in the neo4j Web-browser as a full Cypher query!\n",
    "- Please Don't run this if you already created all the graph nodes and relationships.\n",
    "\n",
    "```\n",
    "MERGE (TheMatrix:Movie {id:4, title:'The Matrix', year:1999, tagline:'Welcome to the Real World'})\n",
    "\n",
    "MERGE (Keanu:Person {id:5, name:'Keanu Reeves', born:1964})\n",
    "MERGE (Carrie:Person {id:6, name:'Carrie-Anne Moss', born:1967})\n",
    "MERGE (Laurence:Person {id:7,name:'Laurence Fishburne', born:1961})\n",
    "MERGE (Hugo:Person {id:8,name:'Hugo Weaving', born:1960})\n",
    "\n",
    "MERGE (LillyW:Person:Director {id:9,name:'Lilly Wachowski', born:1967})\n",
    "MERGE (LanaW:Person:Director {id:10,name:'Lana Wachowski', born:1965})\n",
    "\n",
    "\n",
    "MERGE (Keanu)-[:PLAYED {role:['Neo']}]->(TheMatrix)\n",
    "MERGE (Carrie)-[:PLAYED {role:['Trinity']}]->(TheMatrix)\n",
    "MERGE (Laurence)-[:PLAYED {role:['Morpheus']}]->(TheMatrix)\n",
    "MERGE (Hugo)-[:PLAYED {role:['Agent Smith']}]->(TheMatrix)\n",
    "\n",
    "MERGE (LillyW)-[:DIRECTED]->(TheMatrix)\n",
    "MERGE (LanaW)-[:DIRECTED]->(TheMatrix)\n",
    "\n",
    "```\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### After Running Such new Insertions to The Graph it will look like That"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center> <img src=\"moviesGraph.JPG\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all the Person Nodes in the GDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1967, id=9, label='Director', name='Lilly Wachowski')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1965, id=10, label='Director', name='Lana Wachowski')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1952, id=11, label='Director', name='Joel Silver')\n"
     ]
    }
   ],
   "source": [
    "# Get all the Person Nodes in the Graph DB\n",
    "query = \"\"\"\n",
    "    MATCH (p:Person)\n",
    "    RETURN p\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get All Movies from the Previous Graph, sorted from recent to old"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=4, title='The Matrix', year=1999)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n"
     ]
    }
   ],
   "source": [
    "# Get All Movies from the Previous Graph, sorted from recent to old\n",
    "query = \"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    RETURN m\n",
    "    ORDER BY m.year DESC\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get All Movies released in the <b>90s</b> (after year (1990) and before 2000) ordered from old to recent."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=4, title='The Matrix', year=1999)\n"
     ]
    }
   ],
   "source": [
    "# Get All Movies released in the 90s (after year (1990) and before 2000) ordered from old to recent.\n",
    "query = \"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    WHERE m.year > 1990 AND m.year < 2000\n",
    "    RETURN m\n",
    "    ORDER BY m.year ASC\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get Movies and Actors from the Previous Graph "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=2, name='Micheal Douglas')\tPLAYED(Node('Person', id=2, name='Micheal Douglas'), Node('Movie', id=1, title='Wall Street', year=1987), role=['Gordon Gekko'])\tNode('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Person', id=3, name='Martin Sheen')\tPLAYED(Node('Person', id=3, name='Martin Sheen'), Node('Movie', id=1, title='Wall Street', year=1987), role=['Carl Fox'])\tNode('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Person', id=1, name='Charlie Sheen')\tPLAYED(Node('Person', id=1, name='Charlie Sheen'), Node('Movie', id=1, title='Wall Street', year=1987), role=['Bud Fox'])\tNode('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Person', id=2, name='Micheal Douglas')\tPLAYED(Node('Person', id=2, name='Micheal Douglas'), Node('Movie', id=2, title='The American President', year=1995), role=['President Andrew Shepherd'])\tNode('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Person', id=3, name='Martin Sheen')\tPLAYED(Node('Person', id=3, name='Martin Sheen'), Node('Movie', id=2, title='The American President', year=1995), role=['A.J. MacInerney'])\tNode('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Person', id=4, name='Morgan Freeman')\tPLAYED(Node('Person', id=4, name='Morgan Freeman'), Node('Movie', id=3, title='The Shawshank Redemption', year=1994), role=[\"Ellis Boyd 'Red' Redding\"])\tNode('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\tPLAYED(Node('Person', born=1960, id=8, name='Hugo Weaving'), Node('Movie', id=4, title='The Matrix', year=1999), role=['Agent Smith'])\tNode('Movie', id=4, title='The Matrix', year=1999)\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\tPLAYED(Node('Person', born=1960, id=7, name='Laurence Fishburne'), Node('Movie', id=4, title='The Matrix', year=1999), role=['Morpheus'])\tNode('Movie', id=4, title='The Matrix', year=1999)\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\tPLAYED(Node('Person', born=1967, id=6, name='Carrie-Anne Moss'), Node('Movie', id=4, title='The Matrix', year=1999), role=['Trinity'])\tNode('Movie', id=4, title='The Matrix', year=1999)\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\tPLAYED(Node('Person', born=1964, id=5, name='Keanu Reeves'), Node('Movie', id=4, title='The Matrix', year=1999), role=['Neo'])\tNode('Movie', id=4, title='The Matrix', year=1999)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (p:Person)-[r:PLAYED]->(m:Movie)\n",
    "    RETURN p, r, m\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get count of \"Movies\" in your graphDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Count=  4\n"
     ]
    }
   ],
   "source": [
    "# Get count of \"Movies\" in your graphDB\n",
    "query = \"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    RETURN count(m)\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"Count= \",d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### In this graph, for every \"Actor\" get the number of movies he played "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Micheal Douglas'\t2\n",
      "'Martin Sheen'\t2\n",
      "'Charlie Sheen'\t1\n",
      "'Morgan Freeman'\t1\n",
      "'Hugo Weaving'\t1\n",
      "'Laurence Fishburne'\t1\n",
      "'Carrie-Anne Moss'\t1\n",
      "'Keanu Reeves'\t1\n"
     ]
    }
   ],
   "source": [
    "# In this graph, for every \"Actor\" get the number of movies he played \n",
    "query = \"\"\"\n",
    "    MATCH (p:Person)-[r:PLAYED]->(m:Movie)\n",
    "    RETURN p.name, count(m) AS nbMovies\n",
    "    ORDER BY nbMovies DESC\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### In this graph, List the movies that every Actor Played\n",
    "<b>Hint:</b> use the aggregation function \"COLLECT\" to group movies as a list."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# In this graph, List the movies that every Actor Played\n",
    "# Hint: use the aggregation function \"COLLECT\" to group movies as a list. (not done)\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (p:Person)-[r:PLAYED]->(m:Movie)\n",
    "    COLLECT (m.title) AS movies\n",
    "    RETURN p.name, movies\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get List of Directors From the graph "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get List of Directors From the graph \n",
    "query = \"\"\"\n",
    "    MATCH (p:Person)-[r:DIRECTED]->(m:Movie)\n",
    "    RETURN p.name\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "print(\"Directors: \")\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Update the release year of \"The Matrix\" movie to be 2005, and show that movie before and after this update"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Update the release year of \"The Matrix\" movie to be 2005, and show that movie before and after this update\n",
    "print(\"The Matrix before updte: \")\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (m:Movie {id: 4})\n",
    "    RETURN m\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d,\"\\n\")\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (m:Movie {id: 4})\n",
    "    SET m.year = 2005\n",
    "    RETURN m\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "print(\"The matrix Updated: \")\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DELTE From Graph elements (Nodes or Relationships), and Removing Properities with Cypher\n",
    "\n",
    "* The <b>REMOVE</b> clause is used to remove properties from nodes and relationships, and to remove labels from nodes.\n",
    "\n",
    "* While the <b> DELETE </b> clause is used to delete nodes, relationships or paths."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Remove the ```tagLine``` from the ```Movie``` Node\n",
    "\n",
    "- Notice Movie \"The Matrix\" before and after!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"YOUR CYPHER QUERY HERE\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Remove the ```Director``` label from Person nodes with that label\n",
    "\n",
    "* Note that, only some of these people have the \"Director\" Label\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### First, show all the Person nodes in your DB "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"YOUR CYPHER QUERY HERE\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Second: Remove the Director Label, and Return the result to make sure that labels are already removed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query= \"\"\"YOUR CYPHER QUERY HERE\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Delete \"Agent Smith\", the Actor with the name <b>\"Hugo Weaving\"</b>  as he is the bad guy here :) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query= \"\"\"YOUR CYPHER QUERY HERE\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Try to get/find this actor again "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query= \"\"\"YOUR CYPHER QUERY HERE\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Task 2 (OPTIONAL TASK) : Perform some queries on the Graph database using Cypher Query Language.\n",
    "In this task, you are going to:\n",
    "- Import movielens graph database into neo4j\n",
    "- Perform Several Cypher quereis on this database"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### The movielens Dataset\n",
    "\n",
    "- The dataset that we are using consists of data obtained from MovieLens 1, a recommender system whose users give movies a rate between 1 and 5 based on whether they dislike or love them. \n",
    "- MovieLens uses the rates to recommend movies that its users might like. \n",
    "- The dataset is modeled as a directed graph and consists of 100,004 rates on 9,125 movies across 671 users between January 9th, 1995 and October 16, 2016. - The dataset also contains the names of the directors and the actors of each movie. A directed graph G = (V , E ) consists of:\n",
    "\n",
    "   - A set V of nodes corresponding to the entities, such as movies, users, actors and directors.\n",
    "   - A set E of links, each connecting two nodes and representing a relationship between two entities. For instance, a link between a director and a movie represents the relationship “directed by”.\n",
    "\n",
    "\n",
    "##### Import mvielens.db into Neo4j\n",
    "- 1- Please, copy the attached 'mvielens.db' graph DB file to your neo4jhome/data/databases/\n",
    "-  2- change the active DB from the neo4j configuration to the mvielens.db, by default it is graph.db by edititng the file neo4jhome/conf/neo4j.conf and change graph.db to mvielens.db in the line dbms.active_database=graph.db (after removing the '#' from the begininnig of that line)\n",
    "-  3- Don't forget to restart neo4j server (neo4jhome/bin/neo4j restart).\n",
    "\n",
    "-  4- In the following subtasks, Write the Cypher Query which will perform each of the following tasks"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Simplified Schema with labels of DB:\n",
    "- If your run this command (\"call db.schema()\") into your DB you should see such graph DB schema"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"movielensschema.JPG\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the distinct genres of the movies in the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cqlEdgeQuery = 'YOUR CYPHER QUERY HERE'\n",
    "\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    nodes = graphDB_Session.run(cqlEdgeQuery)\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ipython-cypher\n",
    "[ipython-cypher](https://github.com/versae/ipython-cypher) is another way to connect to a graph database in python. it uses <b> neo4jrestclient_ driver </b>, then issue Cypher commands within IPython or IPython Notebook.\n",
    "#### ipython-cypher install"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "! pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Inside IPython, load the extension:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### And then you are reay to go by using the <b>%cypher</b> or <b>%%cypher</b> line magic:\n",
    "\n",
    "you have to write down the connection url http://username:password@127.0.0.1:7474/db/data after the %%cypher to access your active DB using the neo4j http port (7474)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- '''%cypher''' is intended for one-line Cypher queries and '''%%cypher''' is intended for multi-line Cypher queries. \n",
    "- Placing \"%%cypher\" above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   MATCH (g:Genre) RETURN Distinct g.name AS genre"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Get the number of movies in the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   MATCH (m:Movie) RETURN m"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title of the movies released in 2005"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE \n",
    "##(make it as multiline if you want)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the number of directors by movie. Sort in decreasing order."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the names of the directors and the title of the movies that they directed and in which they also played."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the genres of the movies in which Tom Hanks played."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title and the rate of all the movies that the user number 3 rated. Sort by rate in decreasing order."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the five movies that obtained the best average rate among the movies that have been rated by at least 100 users."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " ## How long did it take you to solve the homework?\n",
    " \n",
    "Please answer as precisely as you can. It does not affect your points or grade in any way. It is okey, if it took 0.5 hours or 24 hours. The collected information will be used to improve future homeworks."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<font color=\"red\"><b>Answer:</b></font>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**<center> <font color='red'>THANK YOU FOR YOUR EFFORT!</font></center>**"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
